results/out/aleph.ring-middleware.sync.java15.ShenandoahGC.r30k.t16.c400.d600s.out
Running 10m test @ http://localhost:9999/math/plus?x=1&y=2
  16 threads and 400 connections
  Thread calibration: mean lat.: 1.598ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.645ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.597ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.563ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.622ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.676ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.333ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.707ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.762ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.728ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.667ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.661ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.654ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.820ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.587ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.750ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.32ms    1.34ms  96.38ms   95.95%
    Req/Sec     1.98k   488.13     6.44k    70.61%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.14ms
 75.000%    1.59ms
 90.000%    2.13ms
 99.000%    6.15ms
 99.900%   17.60ms
 99.990%   33.98ms
 99.999%   63.07ms
100.000%   96.45ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.059     0.000000            1         1.00
       0.458     0.100000      1773561         1.11
       0.662     0.200000      3548850         1.25
       0.834     0.300000      5315944         1.43
       0.990     0.400000      7079961         1.67
       1.140     0.500000      8853147         2.00
       1.216     0.550000      9737306         2.22
       1.296     0.600000     10618281         2.50
       1.383     0.650000     11511968         2.86
       1.478     0.700000     12389922         3.33
       1.589     0.750000     13276723         4.00
       1.652     0.775000     13719403         4.44
       1.721     0.800000     14162178         5.00
       1.798     0.825000     14601964         5.71
       1.888     0.850000     15045930         6.67
       1.995     0.875000     15485981         8.00
       2.059     0.887500     15708773         8.89
       2.131     0.900000     15928768        10.00
       2.213     0.912500     16148807        11.43
       2.307     0.925000     16369109        13.33
       2.417     0.937500     16592184        16.00
       2.477     0.943750     16701062        17.78
       2.545     0.950000     16811547        20.00
       2.623     0.956250     16923680        22.86
       2.713     0.962500     17034215        26.67
       2.825     0.968750     17143358        32.00
       2.897     0.971875     17199033        35.56
       2.985     0.975000     17253991        40.00
       3.103     0.978125     17309472        45.71
       3.283     0.981250     17364675        53.33
       3.677     0.984375     17419817        64.00
       4.103     0.985938     17447428        71.11
       4.831     0.987500     17475126        80.00
       5.671     0.989062     17502820        91.43
       6.479     0.990625     17530405       106.67
       7.331     0.992188     17558059       128.00
       7.863     0.992969     17571899       142.22
       8.399     0.993750     17585675       160.00
       9.095     0.994531     17599542       182.86
       9.623     0.995313     17613425       213.33
      10.535     0.996094     17627184       256.00
      11.047     0.996484     17634059       284.44
      11.615     0.996875     17640975       320.00
      12.167     0.997266     17647855       365.71
      12.831     0.997656     17654774       426.67
      13.903     0.998047     17661696       512.00
      14.623     0.998242     17665136       568.89
      15.351     0.998437     17668621       640.00
      16.047     0.998633     17672081       731.43
      16.719     0.998828     17675500       853.33
      17.743     0.999023     17678985      1024.00
      18.447     0.999121     17680707      1137.78
      19.183     0.999219     17682439      1280.00
      20.079     0.999316     17684145      1462.86
      21.071     0.999414     17685880      1706.67
      22.271     0.999512     17687618      2048.00
      23.007     0.999561     17688466      2275.56
      23.887     0.999609     17689329      2560.00
      24.815     0.999658     17690194      2925.71
      25.839     0.999707     17691053      3413.33
      27.087     0.999756     17691916      4096.00
      27.919     0.999780     17692350      4551.11
      28.815     0.999805     17692783      5120.00
      29.839     0.999829     17693216      5851.43
      30.911     0.999854     17693647      6826.67
      32.335     0.999878     17694077      8192.00
      33.151     0.999890     17694292      9102.22
      34.175     0.999902     17694509     10240.00
      35.231     0.999915     17694724     11702.86
      36.671     0.999927     17694941     13653.33
      38.911     0.999939     17695160     16384.00
      40.223     0.999945     17695264     18204.44
      41.663     0.999951     17695373     20480.00
      43.359     0.999957     17695481     23405.71
      45.343     0.999963     17695588     27306.67
      48.031     0.999969     17695696     32768.00
      49.823     0.999973     17695750     36408.89
      51.871     0.999976     17695804     40960.00
      53.887     0.999979     17695858     46811.43
      56.159     0.999982     17695912     54613.33
      58.559     0.999985     17695966     65536.00
      59.711     0.999986     17695994     72817.78
      61.247     0.999988     17696020     81920.00
      62.815     0.999989     17696047     93622.86
      64.095     0.999991     17696074    109226.67
      66.367     0.999992     17696101    131072.00
      66.943     0.999993     17696115    145635.56
      68.415     0.999994     17696128    163840.00
      70.207     0.999995     17696142    187245.71
      71.807     0.999995     17696156    218453.33
      72.703     0.999996     17696169    262144.00
      74.239     0.999997     17696177    291271.11
      74.815     0.999997     17696182    327680.00
      75.391     0.999997     17696189    374491.43
      77.503     0.999998     17696196    436906.67
      78.271     0.999998     17696203    524288.00
      78.527     0.999998     17696206    582542.22
      78.655     0.999998     17696210    655360.00
      79.167     0.999999     17696213    748982.86
      80.383     0.999999     17696216    873813.33
      82.367     0.999999     17696220   1048576.00
      82.623     0.999999     17696221   1165084.44
      83.391     0.999999     17696223   1310720.00
      84.095     0.999999     17696225   1497965.71
      84.159     0.999999     17696226   1747626.67
      84.607     1.000000     17696228   2097152.00
      84.671     1.000000     17696229   2330168.89
      84.799     1.000000     17696230   2621440.00
      84.991     1.000000     17696231   2995931.43
      84.991     1.000000     17696231   3495253.33
      85.183     1.000000     17696232   4194304.00
      86.399     1.000000     17696234   4660337.78
      86.399     1.000000     17696234   5242880.00
      86.399     1.000000     17696234   5991862.86
      86.399     1.000000     17696234   6990506.67
      86.399     1.000000     17696234   8388608.00
      87.167     1.000000     17696235   9320675.55
      87.167     1.000000     17696235  10485760.00
      87.167     1.000000     17696235  11983725.71
      87.167     1.000000     17696235  13981013.34
      87.167     1.000000     17696235  16777216.00
      96.447     1.000000     17696236  18641351.10
      96.447     1.000000     17696236          inf
#[Mean    =        1.324, StdDeviation   =        1.342]
#[Max     =       96.384, Total count    =     17696236]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  17996259 requests in 10.00m, 3.00GB read
Requests/sec:  29993.77
Transfer/sec:      5.12MB